In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'A' : [21, np.nan, 22, 4, np.nan],
    'B' : range(31, 36),
    'C' : [np.nan, np.nan, np.nan, np.nan, np.nan],
    'D' : [46, 47, np.nan, 48, 49]
}

In [3]:
df = pd.DataFrame(data=data)
df

      A   B   C     D
0  21.0  31 NaN  46.0
1   NaN  32 NaN  47.0
2  22.0  33 NaN   NaN
3   4.0  34 NaN  48.0
4   NaN  35 NaN  49.0

In [4]:
tot_nan = df.isnull().sum().sum()
print(tot_nan)

8

In [5]:
df.fillna(method='ffill')

      A   B   C     D
0  21.0  31 NaN  46.0
1  21.0  32 NaN  47.0
2  22.0  33 NaN  47.0
3   4.0  34 NaN  48.0
4   4.0  35 NaN  49.0

In [6]:
df.fillna(method='bfill')

      A   B   C     D
0  21.0  31 NaN  46.0
1  22.0  32 NaN  47.0
2  22.0  33 NaN  48.0
3   4.0  34 NaN  48.0
4   NaN  35 NaN  49.0

In [7]:
df.fillna(0)

      A   B    C     D
0  21.0  31  0.0  46.0
1   0.0  32  0.0  47.0
2  22.0  33  0.0   0.0
3   4.0  34  0.0  48.0
4   0.0  35  0.0  49.0